# Awari - Data Science

## Exercícios Unidade 4 - Parte 1

Neste Jupyter notebook você irá resolver uma exercícios utilizando a linguagem Python e a biblioteca Pandas.

Todos os datasets utilizados nos exercícios estão salvos na pasta *datasets*.

Todo o seu código deve ser executado neste Jupyter Notebook. Por fim, se desejar, revise as respostas com o seu mentor.

In [1]:
import pandas as pd

### Passo 1. Importando os dados

Carregue os dados salvos no arquivo ***datasets/users_dataset.txt***.

Esse arquivo possui um conjunto de dados de trabalhadores com 5 colunas separadas pelo símbolo "|" (pipe) e 943 linhas.

*Dica: utilize a função read_csv com os parâmetros sep e index_col*

In [2]:
users = pd.read_csv('datasets/users_dataset.txt', sep='|', index_col=None)

### Passo 2. Mostre as 25 primeiras linhas do dataset.

*Dica: use a função head do DataFrame*

In [3]:
users.head(25)

    user_id  age gender     occupation zip_code
0         1   24      M     technician    85711
1         2   53      F          other    94043
2         3   23      M         writer    32067
3         4   24      M     technician    43537
4         5   33      F          other    15213
5         6   42      M      executive    98101
6         7   57      M  administrator    91344
7         8   36      M  administrator    05201
8         9   29      M        student    01002
9        10   53      M         lawyer    90703
10       11   39      F          other    30329
11       12   28      F          other    06405
12       13   47      M       educator    29206
13       14   45      M      scientist    55106
14       15   49      F       educator    97301
15       16   21      M  entertainment    10309
16       17   30      M     programmer    06355
17       18   35      F          other    37212
18       19   40      M      librarian    02138
19       20   42      F      homemaker    95660
20       21   26      M         writer    30068
21       22   25      M         writer    40206
22       23   30      F         artist    48197
23       24   21      F         artist    94533
24       25   39      M       engineer    55107

### Passo 3. Mostre as 10 últimas linhas

In [4]:
users.tail(10)

     user_id  age gender     occupation zip_code
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

### Passo 4. Qual o número de linhas e colunas do DataFrame?

In [5]:
users.shape
# Resposta: 943 linhas e 5 colunas

(943, 5)

### Passo 5. Mostre o nome de todas as colunas.

In [6]:
users.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Passo 6. Qual o tipo de dado de cada columa?

In [7]:
users.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Passo 7. Mostre os dados da coluna *occupation*.

In [8]:
users['occupation']

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

### Passo 8. Quantas ocupações diferentes existem neste dataset?

In [9]:
users['occupation'].nunique()

21

### Passo 9. Qual a ocupação mais frequente?

In [10]:
users['occupation'].value_counts()
# Resposta: A ocupação mais frequente é de estudante com 196 pessoas.

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
salesman          12
lawyer            12
none               9
doctor             7
homemaker          7
Name: occupation, dtype: int64

### Passo 10. Qual a idade média dos usuários?

In [11]:
users['age'].mean()

34.05196182396607

Referências: https://github.com/guipsamora/pandas_exercises

### Awari -  <a href="https://awari.com.br/"> awari.com.br</a>